Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult
Errors for the Free Form Rebar

Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult.RebarCantBeBent
A rebar constructed from curves can't be bent according to the bending radius.

Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult.InvalidLoop
Curves doesn't form a valid curve loop.

Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult.UnboundCurve
One or more of the input curves was unbounded.

Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult.NullCurve
One or more of the input curves was null.

Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult.Undefined
An unexpected error occured.

Autodesk.Revit.DB.Structure.RebarFreeFormValidationResult.Success
Operation was done with success.